In [1]:
import numpy as np
import pandas as pd

In [4]:
rng = np.random.RandomState(42)
ser = pd.Series(rng.randint(0, 10, 4))
# randint -> (low : int, high : int, optional, size : int or tuple of ints, optional)
# size -> Default is None, in which case a single value is returned. So if you want to return more then 1, you need to specify that
ser

0    6
1    3
2    7
3    4
dtype: int32

In [5]:
df = pd.DataFrame(rng.randint(0, 10, (3, 4)), columns=['A', 'B', 'C', 'D'])
df

   A  B  C  D
0  6  9  2  6
1  7  4  3  7
2  7  2  5  4

In [6]:
# Если применить универсальную функцию NumPy к любому из этих объектов,
# результатом будет другой объект библиотеки Pandas с сохранением индексов:
np.exp(ser)

0     403.428793
1      20.085537
2    1096.633158
3      54.598150
dtype: float64

In [7]:
np.sin(df * np.pi / 4)

          A             B         C             D
0 -1.000000  7.071068e-01  1.000000 -1.000000e+00
1 -0.707107  1.224647e-16  0.707107 -7.071068e-01
2 -0.707107  1.000000e+00 -0.707107  1.224647e-16

In [8]:
# При бинарных операциях над двумя объектами Series или DataFrame библиотека
# Pandas будет выравнивать индексы в процессе выполнения операции. Это очень
# удобно при работе с неполными данными.

area = pd.Series({
    'Alaska': 1723337,
    'Texas': 695662,
    'California': 423967,
}, name='area')

population = pd.Series({
    'California': 38332521,
    'Texas': 26448193,
    'New York': 19651127,
}, name='population')

population / area

Alaska              NaN
California    90.413926
New York            NaN
Texas         38.018740
dtype: float64

In [10]:
area.index | population.index

Index(['Alaska', 'California', 'New York', 'Texas'], dtype='object')

In [11]:
 A = pd.Series([2, 4, 6], index=[0, 1, 2])
 B = pd.Series([1, 3, 5], index=[1, 2, 3])
 A + B

0    NaN
1    5.0
2    9.0
3    NaN
dtype: float64

In [14]:
# A.add(B) == A + B
# fill_value takes default value, instead of writing NaN
A.add(B, fill_value=0)

0    2.0
1    5.0
2    9.0
3    5.0
dtype: float64

In [15]:
# При выполнении операций над объектами DataFrame происходит аналогичное 
# выравнивание как для столбцов, так и для индексов:
A = pd.DataFrame(rng.randint(0, 20, (2, 2)), columns=list('AB'))
A

   A   B
0  1  11
1  5   1

In [17]:
B = pd.DataFrame(rng.randint(0, 10, (3, 3)), columns=list('BAC'))
B

   B  A  C
0  3  8  2
1  4  2  6
2  4  8  6

In [18]:
A + B

     A     B   C
0  9.0  14.0 NaN
1  7.0   5.0 NaN
2  NaN   NaN NaN

In [19]:
A.add(B, fill_value=0)

     A     B    C
0  9.0  14.0  2.0
1  7.0   5.0  6.0
2  8.0   4.0  6.0

In [20]:
# заполним отсутствующие значения средним значением всех элементов объекта A
# (которое вычислим,выстроив сначала значения объекта A в один столбец с помощью функции stack)
fill = A.stack().mean()
A.add(B, fill_value=fill)

      A     B     C
0   9.0  14.0   6.5
1   7.0   5.0  10.5
2  12.5   8.5  10.5

In [21]:
A.stack()

0  A     1
   B    11
1  A     5
   B     1
dtype: int32

In [22]:
# Оператор языка Python --- Метод (-ы) библиотеки Pandas
#                     + --- add()
#                     – --- sub(), subtract()
#                     * --- mul(), multiply()
#                     / --- truediv(), div(), divide()
#                    // --- floordiv()
#                     % --- mod()
#                    ** --- pow()

In [23]:
A = rng.randint(10, size=(3, 4))
A

array([[1, 3, 8, 1],
       [9, 8, 9, 4],
       [1, 3, 6, 7]])

In [24]:
A - A[0]

array([[ 0,  0,  0,  0],
       [ 8,  5,  1,  3],
       [ 0,  0, -2,  6]])

In [29]:
df = pd.DataFrame(A, columns=list('QRST'))
df - df.iloc[0]

   Q  R  S  T
0  0  0  0  0
1  8  5  1  3
2  0  0 -2  6

In [30]:
# Если же вы хотите выполнить эту операцию по столбцам, то можете воспользоваться 
# упомянутыми выше методами объектов, указав ключевое слово axis:
df.subtract(df['R'], axis=0)

   Q  R  S  T
0 -2  0  5 -2
1  1  0  1 -4
2 -2  0  3  4

In [32]:
halfrow = df.iloc[0, ::2]
halfrow

Q    1
S    8
Name: 0, dtype: int32

In [33]:
df - halfrow

     Q   R    S   T
0  0.0 NaN  0.0 NaN
1  8.0 NaN  1.0 NaN
2  0.0 NaN -2.0 NaN

In [34]:
df

   Q  R  S  T
0  1  3  8  1
1  9  8  9  4
2  1  3  6  7